app/Controllers/Home.php

SELECT *
FROM `users`
---
    public function pengguna()
    {
        $data = [
            'title' => 'Data pengguna',
            'pengguna' => $this->user->findAll(),

SELECT *
FROM `users`
---
    public function tambahPengguna()
    {
        $data = [
            'title' => 'Data pengguna',
            'pengguna' => $this->user->findAll(),