app/Controllers/Tele.php

SELECT *
FROM `barang_keluar`
ORDER BY `id` DESC
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `barang_keluar`
---
            $tujuan = $this->request->getPost('tujuan');
            $jumlah = $this->request->getPost('jumlah');
            // ID TRANSAKSI
            $barang = $this->barangKeluar->orderBy('id','DESC')->first();
            $kode = $this->barangKeluar->orderBy('id','DESC')->countAllResults() == null ? 'TRK-0722000' : $barang['id_transaksi'];

INSERT INTO `barang_keluar` (`user_nik`, `id_transaksi`, `tanggal`, `kode_barang`, `nama_barang`, `jumlah`, `tujuan`, `satuan`) VALUES ('10001', 'TRK-0722011', '2022-07-28', 'BAR-0121001', 'Nutrisari', '1', 'Bandung', 'Pack')
---
                    'msg' => 'Jumlah barang keluar melebihi batas gudang'
                ];
            }else{
                $insert = $this->barangKeluar->insert([
                    'user_nik' => $nik,
                    'id_transaksi' => $format,
                    'tanggal' => $date,
                    'kode_barang' => $kode_barang,
                    'nama_barang' => $nama_barang,
                    'jumlah' => $jumlah,
                    'tujuan' => $tujuan,
                    'satuan' => $satuanGudang,
                ]);

SELECT *
FROM `gudang`
---
    public function allBarang()
    {
        return $this->respond($this->gudang->findAll(),200);