app/Models/GudangModel.php

SELECT *
FROM `gudang`
WHERE `kode_barang` = 'BAR-0121001'
---
    public function findTrx($kode)
    {
        $cek = $this->where('kode_barang',$kode)->get();