app/Models/TeleModel.php

SELECT *
FROM `tele`
WHERE `chat_id` = '5491587178'
---
    public function cekCmd($chatid)
    {
        $cek = $this->where('chat_id',$chatid)->get();

SELECT *
FROM `tele`
WHERE `chat_id` = '2030064010'
---
    public function tambahCmd($chatid)
    {
        if($this->where('chat_id',$chatid)->get()->getNumRows() >= 1){