app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `username` = 'wanda'
AND `password` = 'wanda'
---
    public function login($user,$pass)
    {
        $result = $this->where(['username' => $user, 'password' => $pass])->get();

SELECT *
FROM `users`
WHERE `id` = '26'
---
    public function userDetail($id){
        $result = $this->where('id',$id)->get();

SELECT *
FROM `users`
WHERE `chat_id` = '5491587178'
---
    public function cariTele($chatid,$mmk = false)
    {
        $cek = $this->where('chat_id',$chatid)->get();